In [1]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1", "var2", "var3"])
df

   var1  var2  var3
0     1    22    27
1     6    16     8
2     7    23    17
3    15     9    16
4     7     2    10
5     7    23    18
6    12    17    27
7    14    29    20
8    20     9    12
9    13     2    15

In [2]:
df["var2"]

0    22
1    16
2    23
3     9
4     2
5    23
6    17
7    29
8     9
9     2
Name: var2, dtype: int32

In [3]:
df["var2"][0:2]

0    22
1    16
Name: var2, dtype: int32

In [4]:
df[0:2]

   var1  var2  var3
0     1    22    27
1     6    16     8

In [5]:
df[0:2]["var1"]

0    1
1    6
Name: var1, dtype: int32

In [7]:
df[0:2][["var1", "var2"]]

   var1  var2
0     1    22
1     6    16

In [8]:
df

   var1  var2  var3
0     1    22    27
1     6    16     8
2     7    23    17
3    15     9    16
4     7     2    10
5     7    23    18
6    12    17    27
7    14    29    20
8    20     9    12
9    13     2    15

In [9]:
df.var1

0     1
1     6
2     7
3    15
4     7
5     7
6    12
7    14
8    20
9    13
Name: var1, dtype: int32

In [12]:
df[df.var1 > 10]

   var1  var2  var3
3    15     9    16
6    12    17    27
7    14    29    20
8    20     9    12
9    13     2    15

In [13]:
df[df.var1 > 10]["var1"]

3    15
6    12
7    14
8    20
9    13
Name: var1, dtype: int32

In [14]:
df[df.var1 > 10]["var2"]

3     9
6    17
7    29
8     9
9     2
Name: var2, dtype: int32

In [16]:
df[(df.var1 > 10) & (df.var3 > 17)]

   var1  var2  var3
6    12    17    27
7    14    29    20

In [21]:
df.loc[(df.var1 > 10), ["var1", "var2"]]

   var1  var2
3    15     9
6    12    17
7    14    29
8    20     9
9    13     2

In [22]:
df[(df.var1 > 10)] [["var1", "var2"]]

   var1  var2
3    15     9
6    12    17
7    14    29
8    20     9
9    13     2